#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.demo.data.aws_iam_policy_document.aws_iam_policy_document: Reading...
module.demo.aws_s3_bucket.aws_s3_bucket: Refreshing state... [id=cq-glue-target-bucket]
module.demo.data.aws_availability_zones.available: Reading...
module.demo.aws_glue_workflow.workflow: Refreshing state... [id=cq-workflow]
module.demo.data.aws_iam_policy_document.aws_iam_policy_document: Read complete after 0s [id=3118019012]
module.demo.aws_iam_role.aws_iam_role: Refreshing state... [id=AWSGlueServiceRole-cq-role]
module.demo.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.demo.aws_iam_role_policy_attachment.aws_iam_role_policy_attachment: Refreshing state... [id=AWSGlueServiceRole-cq-role-20220727095104529500000001]
module.demo.aws_glue_job.example: Refreshing state... [id=cq-glue-job]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo.aws_glue_catalog_database.aws_glue_catalog_database will be created
  + resource "aws_glue_catalog_database" "aws_glue_catalog_database" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "cq-glue-database"

      + create_table_default_permission {
          + permissions = [
              + "SELECT",
            ]

          + principal {
              + data_lake_principal_identifier = "IAM_ALLOWED_PRINCIPALS"
            }
        }
    }

  # module.demo.aws_glue_catalog_table.aws_glue_catalog_table will be created
  + resource "aws_glue_catalog_table" "aws_glue_catalog_table" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "cq-glue-database"
      + id            = (known after apply)
      + name          = "cq-glue-table"
      + parameters    = {
          + "EXTERNAL"            = "TRUE"
          + "parquet.compression" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index {
          + index_name   = (known after apply)
          + index_status = (known after apply)
          + keys         = (known after apply)
        }

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetInputFormat"
          + location      = "s3://cq-glue-target-bucket/event-streams/my-stream"
          + output_format = "org.apache.hadoop.hive.ql.io.parquet.MapredParquetOutputFormat"

          + columns {
              + name = "my_string"
              + type = "string"
            }
          + columns {
              + name = "my_double"
              + type = "double"
            }
          + columns {
              + name = "my_date"
              + type = "date"
            }
          + columns {
              + name = "my_bigint"
              + type = "bigint"
            }
          + columns {
              + name = "my_struct"
              + type = "struct<my_nested_string:string>"
            }

          + ser_de_info {
              + name                  = "cq-glue-stream"
              + parameters            = {
                  + "serialization.format" = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.parquet.serde.ParquetHiveSerDe"
            }
        }
    }

  # module.demo.aws_glue_classifier.aws_glue_classifier1 will be created
  + resource "aws_glue_classifier" "aws_glue_classifier1" {
      + id   = (known after apply)
      + name = "cq-glue-classifier"

      + csv_classifier {
          + allow_single_column    = false
          + contains_header        = "PRESENT"
          + delimiter              = ","
          + disable_value_trimming = false
          + header                 = [
              + "example1",
              + "example2",
            ]
          + quote_symbol           = "'"
        }
    }

  # module.demo.aws_glue_connection.aws_glue_connection will be created
  + resource "aws_glue_connection" "aws_glue_connection" {
      + arn                   = (known after apply)
      + catalog_id            = (known after apply)
      + connection_properties = (sensitive value)
      + connection_type       = "JDBC"
      + id                    = (known after apply)
      + name                  = "cq-glue-connection"
      + tags_all              = (known after apply)

      + physical_connection_requirements {
          + availability_zone      = "us-east-1a"
          + security_group_id_list = (known after apply)
          + subnet_id              = (known after apply)
        }
    }

  # module.demo.aws_glue_crawler.aws_glue_crawler will be created
  + resource "aws_glue_crawler" "aws_glue_crawler" {
      + arn           = (known after apply)
      + configuration = jsonencode(
            {
              + Grouping = {
                  + TableGroupingPolicy = "CombineCompatibleSchemas"
                }
              + Version  = 1
            }
        )
      + database_name = "cq-glue-database"
      + id            = (known after apply)
      + name          = "cq-crawler"
      + role          = (known after apply)
      + schedule      = "cron(0 1 * 1 *)"
      + tags_all      = (known after apply)

      + catalog_target {
          + database_name = "cq-glue-database"
          + tables        = [
              + "cq-glue-table",
            ]
        }

      + dynamodb_target {
          + path     = "table-name"
          + scan_all = true
        }

      + jdbc_target {
          + connection_name = "cq-glue-connection"
          + path            = "database-name/%"
        }

      + s3_target {
          + exclusions  = [
              + "year-**",
            ]
          + path        = "s3://cq-glue-target-bucket"
          + sample_size = 10
        }

      + schema_change_policy {
          + delete_behavior = "LOG"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # module.demo.aws_glue_data_catalog_encryption_settings.example will be created
  + resource "aws_glue_data_catalog_encryption_settings" "example" {
      + catalog_id = (known after apply)
      + id         = (known after apply)

      + data_catalog_encryption_settings {
          + connection_password_encryption {
              + aws_kms_key_id                       = (known after apply)
              + return_connection_password_encrypted = true
            }

          + encryption_at_rest {
              + catalog_encryption_mode = "SSE-KMS"
              + sse_aws_kms_key_id      = (known after apply)
            }
        }
    }

  # module.demo.aws_glue_dev_endpoint.aws_glue_dev_endpoint will be created
  + resource "aws_glue_dev_endpoint" "aws_glue_dev_endpoint" {
      + arn                                    = (known after apply)
      + availability_zone                      = (known after apply)
      + failure_reason                         = (known after apply)
      + id                                     = (known after apply)
      + name                                   = "cq-dev-endpoint"
      + private_address                        = (known after apply)
      + public_address                         = (known after apply)
      + role_arn                               = "arn:aws:iam::707066037989:role/AWSGlueServiceRole-cq-role"
      + status                                 = (known after apply)
      + tags_all                               = (known after apply)
      + vpc_id                                 = (known after apply)
      + yarn_endpoint_address                  = (known after apply)
      + zeppelin_remote_spark_interpreter_port = (known after apply)
    }

  # module.demo.aws_glue_ml_transform.aws_glue_ml_transform will be created
  + resource "aws_glue_ml_transform" "aws_glue_ml_transform" {
      + arn          = (known after apply)
      + glue_version = (known after apply)
      + id           = (known after apply)
      + label_count  = (known after apply)
      + max_capacity = (known after apply)
      + name         = "cq-glue-ml-transform"
      + role_arn     = "arn:aws:iam::707066037989:role/AWSGlueServiceRole-cq-role"
      + schema       = (known after apply)
      + tags_all     = (known after apply)
      + timeout      = 2880

      + input_record_tables {
          + database_name = "cq-glue-database"
          + table_name    = "cq-glue-table"
        }

      + parameters {
          + transform_type = "FIND_MATCHES"

          + find_matches_parameters {
              + primary_key_column_name = "my_column_1"
            }
        }
    }

  # module.demo.aws_glue_partition.aws_glue_partition will be created
  + resource "aws_glue_partition" "aws_glue_partition" {
      + catalog_id         = (known after apply)
      + creation_time      = (known after apply)
      + database_name      = "cq-glue-database"
      + id                 = (known after apply)
      + last_accessed_time = (known after apply)
      + last_analyzed_time = (known after apply)
      + partition_values   = [
          + "some-value",
        ]
      + table_name         = "cq-glue-table"
    }

  # module.demo.aws_glue_partition_index.aws_glue_partition_index will be created
  + resource "aws_glue_partition_index" "aws_glue_partition_index" {
      + catalog_id    = (known after apply)
      + database_name = "cq-glue-database"
      + id            = (known after apply)
      + table_name    = "cq-glue-table"

      + partition_index {
          + index_name   = "cq-glue-partitition"
          + index_status = (known after apply)
          + keys         = [
              + "my_column_1",
              + "my_column_2",
            ]
        }
    }

  # module.demo.aws_glue_registry.aws_glue_registry will be created
  + resource "aws_glue_registry" "aws_glue_registry" {
      + arn           = (known after apply)
      + id            = (known after apply)
      + registry_name = "cq-glue-registry"
      + tags_all      = (known after apply)
    }

  # module.demo.aws_glue_schema.aws_glue_schema will be created
  + resource "aws_glue_schema" "aws_glue_schema" {
      + arn                   = (known after apply)
      + compatibility         = "NONE"
      + data_format           = "AVRO"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = (known after apply)
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = jsonencode(
            {
              + fields = [
                  + {
                      + name = "f1"
                      + type = "int"
                    },
                  + {
                      + name = "f2"
                      + type = "string"
                    },
                ]
              + name   = "r1"
              + type   = "record"
            }
        )
      + schema_name           = "example"
      + tags_all              = (known after apply)
    }

  # module.demo.aws_glue_security_configuration.example will be created
  + resource "aws_glue_security_configuration" "example" {
      + id   = (known after apply)
      + name = "cq-glue-security-config"

      + encryption_configuration {
          + cloudwatch_encryption {
              + cloudwatch_encryption_mode = "DISABLED"
            }

          + job_bookmarks_encryption {
              + job_bookmarks_encryption_mode = "DISABLED"
            }

          + s3_encryption {
              + kms_key_arn        = (known after apply)
              + s3_encryption_mode = "SSE-KMS"
            }
        }
    }

  # module.demo.aws_glue_trigger.example will be created
  + resource "aws_glue_trigger" "example" {
      + arn         = (known after apply)
      + description = "test trigger"
      + enabled     = true
      + id          = (known after apply)
      + name        = "cq-glue-trigger"
      + state       = (known after apply)
      + tags_all    = (known after apply)
      + type        = "ON_DEMAND"

      + actions {
          + job_name = "cq-glue-job"
        }
    }

  # module.demo.aws_glue_user_defined_function.aws_glue_user_defined_function will be created
  + resource "aws_glue_user_defined_function" "aws_glue_user_defined_function" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + class_name    = "class"
      + create_time   = (known after apply)
      + database_name = "cq-glue-database"
      + id            = (known after apply)
      + name          = "cq-glue-user-function"
      + owner_name    = "owner"
      + owner_type    = "GROUP"

      + resource_uris {
          + resource_type = "ARCHIVE"
          + uri           = "uri"
        }
    }

  # module.demo.aws_iam_role.crawler_role will be created
  + resource "aws_iam_role" "crawler_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sagemaker.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cq-crawler-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.demo.aws_kms_key.aws_kms_key will be created
  + resource "aws_kms_key" "aws_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "KMS key 1"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.demo.module.vpc.aws_egress_only_internet_gateway.this[0] will be created
  + resource "aws_egress_only_internet_gateway" "this" {
      + id       = (known after apply)
      + tags     = {
          + "Name" = "cq-glue"
        }
      + tags_all = {
          + "Name" = "cq-glue"
        }
      + vpc_id   = (known after apply)
    }

  # module.demo.module.vpc.aws_route.private_ipv6_egress[0] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.demo.module.vpc.aws_route.private_ipv6_egress[1] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "cq-glue-private-us-east-1a"
        }
      + tags_all         = {
          + "Name" = "cq-glue-private-us-east-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "cq-glue-private-us-east-1b"
        }
      + tags_all         = {
          + "Name" = "cq-glue-private-us-east-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.demo.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "cq-glue-private-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "cq-glue-private-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.demo.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "cq-glue-private-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "cq-glue-private-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.demo.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = true
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "cq-glue"
        }
      + tags_all                             = {
          + "Name" = "cq-glue"
        }
    }

Plan: 27 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @irmatov, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*